# CurrencyPerBritishThermalUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..CurrencyPerBritishThermalUnit Property
UnitTypeId Class See Also
---
Cost per British thermal unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CurrencyPerBritishThermalUnit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurrencyPerBritishThermalUnit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurrencyPerBritishThermalUnit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace